package com.example.a241221

import com.example.a241221.models.News

class Constants {
    companion object{
        val categories = arrayListOf(
            News("«Бавария» не усилится зимой",
                "https://img4.goodfon.ru/wallpaper/nbig/b/cc/logo-wallpaper-football-bayern-munchen-sport-1.jpg",
                "В «Баварии» не планируют усиление состава в зимнее трансферное окно. Об этом рассказал известный немецкий журналист и инсайдер Кристиан Фальк из Bild.\n" +
                    "\n" +
                    "«Слышал, что «Бавария» сбирается подписать бразильца. Но клуб не планирует никого подписывать в январе», - слова Фалька приводятся на популярной страничке Bayern & Germany в «Твиттере».\n" +
                    "\n" +
                    "Ранее сообщалось, что «Бавария» купит у «Лидса» Рафинью приблизительно за 50 миллионов евро.  \n" +
                    "\n" +
                    "После первого круга «Бавария» уверенно лидирует в чемпионате Германии. Мюнхенцы на девять очков опережают дортмундскую «Боруссию», идущую в Бундеслиге второй.  ",
                "Спорт"),

            News("Nikkei: в Японии могут засекретить патенты на технологии, применимые в военной сфере",
                "https://img5.goodfon.ru/wallpaper/nbig/f/e1/mount-fuji-iaponiia-khonsiu-pagoda.jpg",
                "ТОКИО, 26 декабря. /ТАСС/. Правительство Японии планирует засекретить местные патенты на технологии, которые могут быть использованы иностранными государствами в военных целях. Об этом в воскресенье со ссылкой на источники сообщила газета Nikkei.\n" +
                        "\n" +
                        "Речь идет, в частности, о ядерных и квантовых технологиях. Разработчики соответствующих технологий также не смогут подавать заявку на регистрацию этих патентов в других странах. Засекретив документы, правительство Японии компенсирует прибыль, которую могли бы получить владельцы патентов за 20-летний период лицензирования. Таким образом японские власти рассчитывают предотвратить утечку за рубеж чувствительной информации.\n" +
                        "\n" +
                        "Ожидается, что соответствующая норма может вступить в силу в 2023 финансовом году (начнется с апреля 2023 года).",
                "Технологии"),

            News("\"Джеймс Уэбб\" вышел на орбиту",
                "https://img4.badfon.ru/wallpaper/big/4/4a/james_webb_primary_mirror.jpg",
                "Орбитальный телескоп James Webb отделился от ракеты-носителя Ariane 5, стартовавшей в субботу с космодрома Куру во Французской Гвиане и доставившей его на орбиту. После этого, как сообщило Европейское космическое агентство, телескоп на протяжении четырех недель будет двигаться к пункту назначения во вторую точку Лагранжа. Она находится в четыре раза дальше от Земли, чем Луна, на расстоянии 1,5 млн км на противоположной от Солнца стороне.\n" +
                        "\n" +
                        "\"Джеймс Уэбб\" - это совместный проект Национального управления США по аэронавтике и исследованию космического пространства (НАСА), ЕКА и Канадского космического агентства (ККА). НАСА вложило в проект 8,8 млрд долларов, ЕКА - 815 млн, включая стоимость ракеты и запуска, ККА - 165 млн.\n" +
                        "\n" +
                        "Над тем, чтобы \"Уэбб\" стал реальностью, работали тысячи инженеров и сотни ученых, а также более 300 университетов, организаций и компаний из 29 штатов США и еще 14 стран.\n" +
                        "\n" +
                        "Телескоп, названный в честь Джеймса Уэбба, руководителя программы \"Аполлон\", позволившей человеку побывать на Луне, должен заменить на орбите обсерваторию \"Хаббл\". Это самый мощный из космических телескопов, работающих в инфракрасном диапазоне. Его называют главной надеждой мировой астрономии. Он займется поиском экзопланет и проследит эволюцию Вселенной.",
                "Космос"),

            News("Рэпер Drake сделал памятную татуировку",
                "https://img1.goodfon.ru/wallpaper/nbig/f/c4/drake-young-money-rap.jpg",
                "Основой для тату стала фотография популярного модельера на показе бренда Louis Vuitton. Известно, что Drake и Абло являлись близкими друзьями.\n" +
                        "\n" +
                        "Напомним, что Вирджил Абло умер 28 ноября 2021 года. Причиной смерти стал рак, с которым мужчина боролся несколько лет.\n",
                "Музыка")
        )

    }
}

